Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Returns an NSError object if the regular expression pattern is invalid; otherwise returns nil.firstMatchInString:options:range
ja: 正規表現パターンが無効ならば、NSErrorオブジェクトを返します；さもなければnil.firstMatchInString:options:rangeを返します。

source: Returns an NSHost object representing the host the process is running on.
ja: それの上でプロセスが動作しているホストを表しているNSHostオブジェクトを返します。

source: Returns an NSImage instance associated with the specified name, which can be backed by multiple files representing different resolution versions of the image.
ja: 指定された名前と関連付けられるNSImageインスタンスを返します、それはその画像の異なる解像度バージョンを表している複数のファイルによって裏で支えられることができます。

source: Returns an NSMethod Signature object that contains a description of the method identified by a given selector.
ja: 指定されたセレクタによって識別されるメソッドの説明を含んでいるNSMethod Signatureオブジェクトを返します。

source: Returns an NSPoint typecast from a CGPoint.
ja: CGPointから型キャストされたNSPointを返します。

source: Returns an NSRect typecast from a CGRect.
ja: CGRectから型キャストされたNSRectを返します。

source: Returns an NSSize from a text-based representation.
ja: テキストに基づく表現から、NSSizeを返します。

source: Returns an NSSize typecast from a CGSize.
ja: CGSizeから型キャストされたNSSizeを返します。

source: Returns an NSString object whose contents are derived from the specified C-string path.
ja: NSStringオブジェクトを返します、それの持つ内容は指定されたC文字列パスから引き出されます。

source: Returns an IndexSet filtered according to the result of include Integer.
ja: include Integerの結果によってフィルタされたIndexSetを返します。

source: Returns an array containing all the matches of the regular expression in the string.
ja: 文字列中のその正規表現の全てのマッチを含んでいる配列を返します。

source: Returns an array containing the bindings exposed by the receiver.
ja: レシーバよって露出されるバインディングを含んでいる配列を返します。

source: Returns an array containing the file URLs for all bundle resources having the specified filename extension, residing in the specified resource subdirectory, and limited to global resources and those associated with the specified localization.
ja: 指定されたファイル名拡張子を持ち、指定されたリソース下位ディレクトリに属して、そしてグローバルリソースでそして指定されたローカライゼーションと関連付けられるものに限られる、全てのバンドルリソースに対するファイルURLからなる配列を返します。

source: Returns an array containing the file URLs for all bundle resources having the specified filename extension, residing in the specified resource subdirectory, within the specified bundle.
ja: 指定されたバンドル内部で、指定されたファイル名拡張子を持ち、指定されたリソース下位ディレクトリに属する、全てのバンドルリソースに対するファイルURLを含んでいる配列を返します。

source: Returns an array containing the file for all bundle resources having the specified filename extension, residing in the specified resource subdirectory, and limited to global resources and those associated with the specified localization.
ja: 指定されたファイル名拡張子を持ち、指定されたリソース下位ディレクトリに属して、そしてグローバルリソースでそして指定されたローカライゼーションと関連付けられるものに限られる、全てのバンドルリソースに対するファイルからなる配列を返します。

source: Returns an array containing the non-nil results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果で非-nilのものを含んでいる配列を返します。

source: Returns an array containing the objects in the array at the indexes specified by a given index set.
ja: 与えられたインデックス集合によって指定されるインデックスでの、この配列のオブジェクトを含んでいる配列を返します。

source: Returns an array containing the pathnames for all bundle resources having the specified extension and residing in the bundle directory at the specified path.
ja: 指定されたファイル名拡張子を持ち、指定されたパスでのバンドルディレクトリに属する、全てのバンドルリソースに対するパス名を含んでいる配列を返します。

source: Returns an array containing the pathnames for all bundle resources having the specified filename extension and residing in the resource subdirectory.
ja: 指定されたファイル名拡張子を持ち、リソース下位ディレクトリに属する、全てのバンドルリソースに対するパス名を含んでいる配列を返します。

source: Returns an array containing the results of mapping the given closure over the sequence’s elements.
ja: シーケンスの要素全体にわたって与えられたクロージャをマップする結果を含んでいる配列を返します。

source: Returns an array containing, in order, the elements of the sequence that satisfy the given predicate.
ja: 指定された述部を満足させるものであるシーケンスの要素を、順序通りに、含んでいる配列を返します。

source: Returns an array of NSHTTPCookie objects corresponding to the provided response header fields for the provided URL.
ja: 提供されたURLに対する提供されたレンポンスヘッダフィールドそれらに対応するNSHTTPCookieオブジェクトからなる配列を返します。

source: Returns an array of URLs for the specified common directory in the requested domains.
ja: 要請された領域において、指定される一般的ディレクトリに対するURLの配列を返します。

source: Returns an array of URLs that identify the mounted volumes available on the device.
ja: デバイス上で利用可能なマウントされたボリュームを識別するURLの配列を返します。

source: Returns an array of action names supported by the accessibility element.
ja: アクセシビリティ要素によってサポートされるアクション名からなる配列を返します。

source: Returns an array of all of the application’s bundles that represent frameworks.
ja: アプリケーションの持つバンドルで、フレームワークを表すものの全てを含んでいる配列を返します。

source: Returns an array of all the application’s non-framework bundles.
ja: アプリケーションの持つ非フレームワークバンドル全てからなる配列を返します。

source: Returns an array of attribute names supported by the receiver.
ja: レシーバによってサポートされる属性名からなる配列を返します。

source: Returns an array of file URLs for all resources identified by the specified file extension and located in the specified bundle subdirectory.
ja: 指定されたファイル拡張子によって識別され、そして指定されたバンドル下位ディレクトリに位置する、全てのリソースに対するファイルURLからなる配列を返します。

source: Returns an array of linguistic tags for the specified range and requested tags within the receiving string.
ja: 受け取っている文字列内で指定された範囲と要求されたタグに対する言語学的タグからなる配列を返します。

source: Returns an array of strings identifying the paths for all items in the specified directory.
ja: 指定されたディレクトリの中の全ての項目に対するパスを識別する文字列の配列を返します。

source: Returns an array of strings representing the user-visible components of a given path.
ja: ユーザが見ることのできる与えられたパスの構成要素を表している文字列からなる配列を返します。

source: Returns an array that lists the receiving array’s elements in ascending order, as determined by the comparison method specified by a given NSComparator block.
ja: 新しい配列を返します、それは、受け手側の配列の持つ要素を昇順で、与えられたNSComparatorブロックによって指定される比較メソッドで決定されるとおりに列記するものです。

source: Returns an array that lists the receiving array’s elements in ascending order, as determined by the comparison method specified by a given selector.
ja: 新しい配列を返します、それは、受け手側の配列の持つ要素を昇順で、与えられたセレクタによって指定される比較メソッドで決定されるとおりに列記するものです。

source: Returns an element of the hash table.
ja: ハッシュテーブルのある要素を返します。

source: Returns an empty NSData object if the file is positioned at the end of the file or if an end-of-file indicator is returned on a communications channel.
ja: 空の NSDataオブジェクトを、ファイルがファイルの終わりで位置を突き止められるならば、またはファイル終端指示子が通信経路上で返されるならば、返します。

source: Returns an empty array if no matching resource files are found.
ja: 合致するリソースファイルが見つけられないならば、空の配列を返します。

source: Returns an empty array if the directory exists but has no contents.
ja: ディレクトリが存在するが内容を持たないならば、空の配列を返します。

source: Returns an empty data object if the end of file is reached.
ja: ファイル終端に届くならば空のデータオブジェクトを返します。

source: Returns an energy string for the provided value.
ja: 提供された値に対するエネルギー文字列を返します。

source: Returns an enumerator object that lets you access each object in the array, in order, starting with the element at index 0, as in:
ja: あなたに配列の中の各オブジェクトに、インデックス０での要素で始めて、順番にアクセスをさせる列挙子オブジェクトを返します、このように：

source: Returns an enumerator object that lets you access each object in the array, in reverse order.
ja: 逆順で、あなたに配列の中の各オブジェクトにアクセスをさせる、列挙子オブジェクトを返します。

source: Returns an enumerator object that lets you access each object in the array.
ja: あなたに配列の中の各オブジェクトにアクセスをさせる、列挙子オブジェクトを返します。

source: Returns an exclusive or of the Character Set with another Character Set.
ja: このCharacter Setと別のCharacter Setの排他的論理和を返します。

source: Returns an index that is the specified distance from the given index, unless that distance is beyond a given limiting index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します、その隔たりが与えられた限界インデックスを超えない限りは。

source: Returns an index that is the specified distance from the given index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します。

source: Returns an initialized NSHTTPCookie object using the provided properties.
ja: 提供されたプロパティを使って初期化されたNSHTTPCookieオブジェクトを返します。

source: Returns an initialized NSRegularExpression instance with the specified regular expression pattern and options.
ja: 指定された正規表現パターンとオプションを使って初期化されたNSRegularExpressionインスタンスを返します。

source: Returns an integer contained in self which is greater than integer, or nil if a result could not be found.
ja: selfに含まれるある整数を返します、それはintegerとより大きいものです、または結果が見つけられないならばnilを返します。

source: Returns an integer contained in self which is greater than or equal to integer, or nil if a result could not be found.
ja: selfに含まれるある整数を返します、それはintegerと等しいかより大きいものです、または結果が見つけられないならばnilを返します。

source: Returns an integer contained in self which is less than integer, or nil if a result could not be found.
ja: selfに含まれるある整数を返します、それはintegerとより少ないものです、または結果が見つけられないならばnilを返します。

source: Returns an integer contained in self which is less than or equal to integer, or nil if a result could not be found.
ja: selfに含まれるある整数を返します、それはintegerと等しいかより少ないものです、または結果が見つけられないならばnilを返します。

source: Returns an intersection of the Character Set with another Character Set.
ja: このCharacter Setと別のCharacter Setの交差を返します。

source: Returns an interval that represents the interval where the given date interval and the current instance intersect.
ja: 与えられた日付間隔と現在のインスタンスが交わるところの間隔を表している間隔を返します。

source: Returns an inverted copy of the receiver.
ja: 逆にされたレシーバのコピーを返します。

source: Returns an inverted version of the matrix if possible, or nil if not.
ja: 可能ならばマトリックスの反転されたバージョン、または可能でないならばnilを返します。

source: Returns an iterator over the contents of the data.
ja: データの内容すべてを対象とするイテレータを返します。

source: Returns an iterator over the elements of this sequence.
ja: このシーケンスの要素すべてを対象としたあるイテレータを返します。

source: Returns an iterator over the indexes of this range view.
ja: この範囲ビューのインデックスすべてを対象としたあるイテレータを返します。

source: Returns an iterator over the nodes of the index path.
ja: インデックスパスのノードすべてを対象とするイテレータを返します。

source: Returns an object of a given class representing a given value.
ja: 与えられたクラスのひとつのオブジェクトを返します、それは与えられた値を表しています。

source: Returns an object specifier for the receiver.
ja: レシーバに対するオブジェクト指定子を返します。

source: Returns an object that exposes the plug-in’s scripting interface.
ja: プラグインのもつスクリプティングインターフェイスを露出するオブジェクトを返します。

source: Returns by reference a date representation of a given string and the range of the string used, and returns a Boolean value that indicates whether the string could be parsed.
ja: 参照によって、与えられた文字列の日付表現および使われる文字列の範囲を返します、そして文字列が構文解析できるかどうかを指し示しているブール値を返します。

source: Returns by reference a pointer to a read buffer and, by reference, the number of bytes available, and returns a Boolean value that indicates whether the buffer is available.
ja: 参照によって、読み出しバッファに対するポインタをそして、参照によって、利用可能なバイト数返します、そしてバッファが利用可能かどうかを指し示すブール値を返します。

source: Returns by reference the beginning of the first line and the end of the last line touched by the given range.
ja: 与えられた範囲による最初の行の始まりと到達される最後の行の終わりを参照渡しによって返します。

source: Returns by reference the beginning of the first paragraph and the end of the last paragraph touched by the given range.
ja: 与えられた範囲による最初の段落の始まりと到達される最後の段落の終わりを参照渡しによって返します。

source: Returns context-sensitive help for an object.
ja: あるオブジェクトに対するコンテキスト対応ヘルプを返します。

source: Returns information about the user’s system.
ja: ユーザのシステムについての情報を返します。

source: Returns locale identifiers for which a bundle would provide localized content, given a specified list of candidates for a user's language preferences.
ja: ユーザの言語環境設定に対する候補のある指定されたリストを与えられて、ロケール識別子を返します、それに対してバンドルがローカライズされた内容を提供します。

source: Returns nil when the input is not recognized as valid Base-64.
ja: 入力が有効なBase-64として認識されない場合にnilを返します。

source: Returns one of the hostnames of the receiver.
ja: レシーバのホスト名の１つを返します。

source: Returns one of the network addresses of the receiver.
ja: レシーバのネットワークアドレスの１つを返します。

source: Returns one or more localizations from the specified list that a bundle object would use to locate resources for the current user.
ja: バンドルオブジェクトが現在のユーザのためのリソースを捜し出すために使う指定されたリストからひとつ以上のローカライゼーションを返します。ものです。

source: Returns the Class object for the specified name.
ja: 指定された名前に対するClassオブジェクトを返します。

source: Returns the NSBundle instance that has the specified bundle identifier.
ja: 指定されたバンドル識別子を持つ、NSBundleインスタンスを返します。

source: Returns the NSBundle object with which the specified class is associated.
ja: 指定されたクラスがそれと関連付けられる、NSBundleオブジェクトを返します。

source: Returns the NSHost with the Internet address address.
ja: NSHostを返します、それはインターネットアドレスaddressを持ちます。

source: Returns the Web Frame that contains the plug-in.
ja: プラグインを含んでいるWeb Frameを返します。

source: Returns the C-string encoding assumed for any method accepting a C string as an argument.
ja: C文字列を引数として受け入れる何らかのメソッドのために仮定されるC文字列符号化を返します。

source: Returns the URL for the iCloud container associated with the specified identifier and establishes access to that container.
ja: 指定された識別子と結び付けられたiCloudコンテナに対するURLを返します、そしてそのコンテナに対するアクセスを確立します。

source: Returns the accessibility element at the specified index.
ja: 指定されたインデックスでのアクセシビリティ要素を返します。

source: Returns the attributes of the item at a given path.
ja: 与えられたパスでの項目の属性を返します。

source: Returns the base unit.
ja: 基本単位を返します。

source: Returns the binary log of the page size.
ja: ページサイズのバイナリログを返します。

source: Returns the bundle object that contains the current executable.
ja: 現在の実行可能ファイルを含んでいるバンドルオブジェクトを返します。

source: Returns the character set for characters allowed in a fragment URL component.
ja: ある断片URL構成要素において許可される文字のための文字集合を返します。

source: Returns the character set for characters allowed in a host URL subcomponent.
ja: ホストURL下位構成要素において許可される文字のための文字集合を返します。

source: Returns the character set for characters allowed in a password URL subcomponent.
ja: パスワードURL下位構成要素において許可される文字のための文字集合を返します。

source: Returns the character set for characters allowed in a path URL component.
ja: パスURL構成要素において許可される文字のための文字集合を返します。

source: Returns the character set for characters allowed in a query URL component.
ja: クエリURL構成要素において許可される文字のための文字集合を返します。

source: Returns the character set for characters allowed in a user URL subcomponent.
ja: ユーザURL下位構成要素において許可される文字のための文字集合を返します。

source: Returns the class object for the receiver’s superclass.
ja: レシーバのスーパークラスに対するクラスオブジェクトを返します。

source: Returns the class object.
ja: クラスオブジェクトを返します。

source: Returns the concatenated elements of this sequence of sequences, inserting the given separator between each element.
ja: 各要素の間に与えられたセパレータを挿入して、このシーケンスに属する複数のシーケンスの要素を鎖状に連結して返します。

source: Returns the container directory associated with the specified security application group identifier.
ja: 指定されたセキュリティアプリケーショングルーブ識別子と結び付けられるコンテナディレクトリを返します。

source: Returns the contents of the file at the specified path.
ja: 指定されたパスでのファイルの内容を返します。

source: Returns the context-sensitive help for the specified key from the bundle's help file.
ja: バンドルの持つヘルプファイルから、指定キーに対するコンテキスト依存ヘルプを返します。

source: Returns the corresponding reply event descriptor if an Apple event is being handled on the current thread.
ja: あるアップルイベントが現在のスレッド上で取り扱われているならば、該当する返答イベント記述子を返します。

source: Returns the count of integers in self that intersect range.
ja: selfの中の、rangeと交差する、整数の総数を返します。

source: Returns the count of the specified accessibility array attribute.
ja: 指定されたアクセシビリティ配列属性の数を返します。

source: Returns the current preservation priority for the specified tag.
ja: 指定されたタグに対する現在の維持優先順位を返します。

source: Returns the deepest descendant of the accessibility hierarchy that contains the specified point.
ja: 指定された地点を含む、アクセシビリティ階層の最も深い子孫を返します。

source: Returns the default distributed notification center, representing the local notification center for the computer.
ja: コンピュータに対するローカル通知センターを表している、省略時の分散通知センターを返します。

source: Returns the default formatting behavior for instances of the class.
ja: クラスのインスタンスに対する省略時の書式設定挙動を返します。

source: Returns the descriptor at the specified (one-based) position in the receiving descriptor list.
ja: レシーバである記述子リストの中の指定された位置（１起点）での記述子を返します。

source: Returns the descriptor for current Apple Event if an Apple event is being handled on the current thread.
ja: あるアップルイベントが現在のスレッド上で取り扱われているならば、current Apple Eventに対する記述子を返します。

source: Returns the dictionary key used by a directory to identify a given file wrapper.
ja: 与えられたファイルラッパーを識別する、ディレクトリによって使われる辞書キーを返します。

source: Returns the difference between two dates specified as Date Components.
ja: Date Componentsとして指定された２つの日付の間の差を返します。

source: Returns the difference between two dates.
ja: ２つの日付の間の差を返します。

source: Returns the directories and files (including symbolic links) contained in a given directory.
ja: 与えられたディレクトリの中に含まれる（シンボリックリンクを含む）辞書とファイルを返します。

source: Returns the display name of the file or directory at a specified path.
ja: 指定されたパスでのファイルまたはディレクトリの表示名を返します。

source: Returns the distance between two indices.
ja: ２つのインデックス間の隔たりを返します。

source: Returns the distance from this value to the specified value.
ja: この値から指定された値までの隔たりを返します。

source: Returns the distributed notification center for a particular notification center type.
ja: 特定の通知センター型のための分散通知センターを返します。

source: Returns the elements of the collection, sorted using the given predicate as the comparison between elements.
ja: コレクションの要素を返します、与えられた述部を要素間の比較として使ってソートします。

source: Returns the elements of the collection, sorted.
ja: コレクションの要素を、ソートして、返します。

source: Returns the elements of the sequence, sorted using the given predicate as the comparison between elements.
ja: 与えられた述部を要素間の比較として使ってソートされた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted.
ja: シーケンスの要素を、ソートして返します。

source: Returns the elements of this collection of collections, concatenated.
ja: このコレクションに属する複数のコレクションの要素を、鎖状に連結して返します。

source: Returns the endian format.
ja: エンディアン形式を返します。

source: Returns the file URL for the resource file identified by the specified name and extension and residing in a given bundle directory.
ja: 指定された名前と拡張子によって識別され、そして与えられたバンドルディレクトリに属する、リソースファイルに対するファイルURLを返します。

source: Returns the file URL for the resource identified by the specified name and file extension, located in the specified bundle subdirectory, and limited to global resources and those associated with the specified localization.
ja: 指定された名前とファイル拡張子によって識別され、指定されたバンドル下位ディレクトリに位置して、そしてグローバルリソースでそして指定されたローカライゼーションと関連付けられるものに限られる、リソースに対するファイルURLを返します。

source: Returns the file URL for the resource identified by the specified name and file extension.
ja: 指定された名前とファイル拡張子によって識別されるリソースに対するファイルURLを返します。

source: Returns the file URL of the executable with the specified name in the receiver’s bundle.
ja: レシーバの持つバンドルの中の、指定された名前を持つ実行可能ファイルのファイルURLを返します。

source: Returns the file handle associated with the standard error file.
ja: 標準エラーファイルに結び付けられたファイルハンドルを返します。

source: Returns the file handle associated with the standard input file.
ja: 標準入力ファイルに結び付けられたファイルハンドルを返します。

source: Returns the file handle associated with the standard output file.
ja: 標準出力ファイルに結び付けられたファイルハンドルを返します。

source: Returns the first element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たすこのシーケンスの最初の要素を返します。

source: Returns the first index in which an element of the collection satisfies the given predicate.
ja: 最初のインデックスで、それにおけるコレクションの要素が与えられた述部を満足させるものを返します。

source: Returns the first index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最初のインデックスを返します。

source: Returns the first match of the regular expression within the specified range of the string.
ja: この文字列の指定の範囲内における正規表現の最初のマッチを返します。

source: Returns the first moment of a given Date, as a Date.
ja: 与えられたDateの最初の瞬間を、Dateとして返します。

source: Returns the first object contained in the receiving array that’s equal to an object in other Array.
ja: 受け手側の配列の中に含まれる最初のオブジェクトを返します、それは、other Arrayの中のあるオブジェクトと等しいものです。

source: Returns the first object contained in the receiving array that’s equal to an object in another given array.
ja: 受け手側の配列の中に含まれる最初のオブジェクトを返します、それは、別の与えられた配列の中のあるオブジェクトと同等なものです。

source: Returns the full pathname for the resource file identified by the specified name and extension and residing in a given bundle directory.
ja: 指定された名前と拡張子によって識別され、そして与えられたバンドルディレクトリに属する、リソースファイルに対する完全パス名を返します。

source: Returns the full pathname for the resource identified by the specified name and file extension and located in the specified bundle subdirectory.
ja: 指定されたバンドル下位ディレクトリに位置して、指定された名前とファイル拡張子によって識別されるリソースに対する完全パス名を返します。

source: Returns the full pathname for the resource identified by the specified name and file extension, located in the specified bundle subdirectory, and limited to global resources and those associated with the specified localization.
ja: 指定された名前とファイル拡張子によって識別され、指定されたバンドル下位ディレクトリに位置して、そしてグローバルリソースでそして指定されたローカライゼーションと関連付けられるものに限られる、リソースに対する完全パス名を返します。

source: Returns the full pathname for the resource identified by the specified name and file extension.
ja: 指定された名前とファイル拡張子によって識別されるリソースに対する完全パス名を返します。

source: Returns the full pathname of the executable with the specified name in the receiver’s bundle.
ja: レシーバの持つバンドルの中の、指定された名前を持つ実行可能ファイルの完全パス名を返します。

source: Returns the height of a given rectangle.
ja: 与えられた矩形の高さを返します。

source: Returns the home directory for the current user.
ja: 現在のユーザのホームディレクトリを返します。

source: Returns the home directory for the specified user.
ja: 指定されたユーザのホームディレクトリを返します。

source: Returns the image object associated with the specified name.
ja: 指定された名前と結びつけられた画像を返します。

source: Returns the index in the range after the specified one.
ja: 指定されたものの後の範囲の中のインデックスを返します。

source: Returns the index in the range before the specified one.
ja: 指定されたものの前の範囲の中のインデックスを返します。

source: Returns the index of an object in the array that passes a test in a given block for a given set of enumeration options.
ja: 配列の中の最初のオブジェクトのインデックスを返します、それは、与えられた「ブロック」の中のテストを一式の与えられた列挙オプションで合格したものです。

source: Returns the index of the first object in the array that passes a test in a given block.
ja: 配列の中の最初のオブジェクトのインデックスを返します、それは、与えられた「ブロック」の中のテストを合格したものです。

source: Returns the index of the specified accessibility child in the parent.
ja: 指定された子アクセシビリティの親におけるインデックスを返します。

source: Returns the index that follows the given index in the set.
ja: 集合の中の与えられたインデックスに続くインデックスを返します。

source: Returns the index that follows the given index.
ja: 与えられたインデックスに続くインデックスを返します。

source: Returns the index that immediately follows the specified index.
ja: 指定されたインデックスに直ちに続くインデックスを返します。

source: Returns the index that immediately precedes the specified index.
ja: 指定されたインデックスに直ちに先行するインデックスを返します。

source: Returns the index that precedes the given index in the set.
ja: 集合の中の与えられたインデックスに先行するインデックスを返します。

source: Returns the index that precedes the given index.
ja: 与えられたインデックスに先行するインデックスを返します。

source: Returns the index, from a given set of indexes, of the first object in the array that passes a test in a given block for a given set of enumeration options.
ja: 配列の中の最初のオブジェクトのインデックスを、与えられた一揃いのインデックスから返します、それは、与えられた「ブロック」の中のテストを一式の与えられた列挙オプションで合格したものです。

source: Returns the index, within a specified range, of an object compared with elements in the array using a given NSComparator block.
ja: 与えられたNSComparatorブロックを使って配列の中の要素と比較される、指定された範囲内の、あるオブジェクトのインデックスを返します。

source: Returns the indexes of objects in the array that pass a test in a given block for a given set of enumeration options.
ja: 配列の中のオブジェクトのインデックスを返します、それは与えられた「ブロック」の中のテストを一式の与えられた列挙オプションで合格するものです。

source: Returns the indexes of objects in the array that pass a test in a given block.
ja: 配列中のオブジェクトのインデックスを返します、それは与えられた「ブロック」の中のテストを合格するものです。

source: Returns the indexes, from a given set of indexes, of objects in the array that pass a test in a given block for a given set of enumeration options.
ja: 配列の中のいくらかのオブジェクトのインデックスを、与えられた一揃いのインデックスから返します、それは、与えられた「ブロック」の中のテストを一式の与えられた列挙オプションで合格したものです。

source: Returns the indices of the specified container objects.
ja: いくつかの指定されたコンテナオブジェクトのいくつかのインデックスを返します。

source: Returns the intersection of the specified ranges.
ja: 指定されたそれら範囲の交差を返します。

source: Returns the interval between the receiver and another given date.
ja: レシーバと別の与えられた日付との間の隔たりを返します。
